* Optimize map by adding a chain-counter into each cell.
The chain-counter stores the number of bucket-lists going through it, so we do
not have to traverse the whole array searching for an element. This optimization
should also be compatible with the one Martin is implementing.
** optimize single map (actual implementation)
   :LOGBOOK:
   CLOCK: [2016-11-01 Die 13:06]--[2016-11-01 Die 13:07] =>  0:01
   CLOCK: [2016-11-01 Die 11:38]--[2016-11-01 Die 11:44] =>  0:06
   CLOCK: [2016-10-31 Mon 12:17]--[2016-10-31 Mon 12:32] =>  0:15
   :END:
*** Adjust single map contracts to allow a faster implementation.
    :LOGBOOK:
    CLOCK: [2016-11-01 Die 13:06]--[2016-11-01 Die 13:06] =>  0:00
    CLOCK: [2016-11-01 Die 11:44]--[2016-11-01 Die 11:46] =>  0:02
    CLOCK: [2016-11-01 Die 11:24]--[2016-11-01 Die 11:38] =>  0:14
    :END:
** adjust the double map (add additional array)
   :LOGBOOK:
   CLOCK: [2016-11-01 Die 11:46]--[2016-11-01 Die 11:54] =>  0:08
   :END:
** certify the single map optimization
   :LOGBOOK:
   CLOCK: [2016-11-10 Don 15:18]
   CLOCK: [2016-11-10 Don 15:10]--[2016-11-10 Don 15:12] =>  0:02
   CLOCK: [2016-11-10 Don 14:48]--[2016-11-10 Don 14:55] =>  0:07
   CLOCK: [2016-11-10 Don 13:52]--[2016-11-10 Don 14:35] =>  0:43
   CLOCK: [2016-11-10 Don 11:59]--[2016-11-10 Don 12:07] =>  0:08
   CLOCK: [2016-11-10 Don 11:52]--[2016-11-10 Don 11:57] =>  0:05
   CLOCK: [2016-11-10 Don 10:09]--[2016-11-10 Don 10:30] =>  0:21
   :END:
*** design the abstract logical model
    :LOGBOOK:
    CLOCK: [2016-11-08 Die 18:53]--[2016-11-08 Die 18:53] =>  0:00
    CLOCK: [2016-11-08 Die 18:37]--[2016-11-08 Die 18:52] =>  0:15
    CLOCK: [2016-11-08 Die 15:52]--[2016-11-08 Die 16:01] =>  0:09
    CLOCK: [2016-11-08 Die 15:42]--[2016-11-08 Die 15:47] =>  0:05
    CLOCK: [2016-11-08 Die 15:23]--[2016-11-08 Die 15:33] =>  0:10
    CLOCK: [2016-11-08 Die 12:40]--[2016-11-08 Die 12:45] =>  0:05
    CLOCK: [2016-11-08 Die 12:37]--[2016-11-08 Die 12:38] =>  0:01
    CLOCK: [2016-11-08 Die 12:22]--[2016-11-08 Die 12:36] =>  0:14
    CLOCK: [2016-11-08 Die 11:37]--[2016-11-08 Die 11:43] =>  0:06
    CLOCK: [2016-11-08 Die 10:51]--[2016-11-08 Die 10:53] =>  0:02
    CLOCK: [2016-11-08 Die 10:05]--[2016-11-08 Die 10:11] =>  0:06
    CLOCK: [2016-11-01 Die 15:41]--[2016-11-01 Die 15:56] =>  0:15
    CLOCK: [2016-11-01 Die 15:14]--[2016-11-01 Die 15:38] =>  0:24
    CLOCK: [2016-11-01 Die 15:07]--[2016-11-01 Die 15:09] =>  0:02
    CLOCK: [2016-11-01 Die 13:23]--[2016-11-01 Die 13:35] =>  0:12
    CLOCK: [2016-11-01 Die 13:07]--[2016-11-01 Die 13:08] =>  0:01
    :END:
** certify the double map modifications
